{
  "id": "vp-port-co-ops",
  "title": "Vice President - Portfolio Company Operations",
  "type": "Full-Time",
  "location": "Northwest Pennsylvania",
  "summary": "Lead pre-acquisition evaluation and post-acquisition operational excellence as the primary field operator across our portfolio of manufacturing companies.",
  "description": "<p>The Vice President for Portfolio Operations serves as the primary field operator for the Refounder Venture Studio driving pre-acquisition evaluation and post-acquisition stabilization and operational excellence across multiple companies. This leader deploys the studio's playbook to restore growth trajectories, strengthen management capability and embed a culture of data-driven decision-making.</p><h2>Key Responsibilities</h2><h3>Portfolio Operations Leadership</h3><p>Serve as the on-the-ground partner to each portfolio company (portco) management teams providing both tactical leadership and strategic advisory support during the stabilization and growth phases.</p><h3>Playbook Deployment</h3><p>Create, build, implement and adapt the RVS's playbook across portco's, ensuring consistent execution in areas such as turnaround strategy, cost optimization, revenue growth and cultural alignment.</p><h3>Performance Management</h3><p>Build and manage dashboards and scorecards that integrate operational and financial metrics, enabling real-time visibility into performance, cash flow and key growth levers.</p><h3>Operational Excellence</h3><p>Advise portco leadership on throughput optimization, maintenance practices, process improvements and lean operational design to increase capacity and efficiency.</p><h3>Consultant Coordination</h3><p>Direct and coordinate specialized SWAT/TIGER consultants (operations, quality, supply chain, IT, finance, legal, regulatory, govaffairs) to target and resolve high-impact issues quickly and effectively.</p><h3>Analytical Insight</h3><p>Analyze portfolio trends and performance drivers; prepare board-level reports highlighting progress, risks and recommended interventions.</p><h3>Change Management</h3><p>Champion operational improvement initiatives while developing systems and leadership capacity within each portco to sustain change.</p><h3>Cross-Portfolio Learning</h3><p>Capture lessons learned and continuously refine the studio's playbook, creating scalable value creation frameworks for future refounder investments.</p><h2>Qualifications</h2><ul><li>5+ years of experience in operations, turnaround management, or private equity portfolio operations</li><li>Proven ability to lead within dynamic, multi-entity environments, ideally within a venture studio, holding company or industrial platform</li><li>Strong analytical and financial acumen; proficiency with KPI development, dashboard tools and financial modeling (this capability can be outsourced as needed)</li><li>Experience managing cross-functional teams and external consultants in complex operational settings</li><li>An operational understanding of manufacturing, supply chain or industrial processes preferred</li><li>Exceptional communication and stakeholder management skills, with the ability to influence and align diverse leadership teams</li><li>Entrepreneurial mindset, disciplined execution, and bias for hands-on engagement</li></ul><h2>Success Indicators</h2><ul><li>Measurable improvement in portco KPIs (throughput, margin, working capital, net promoter scores and cultural – DISC - alignment)</li><li>Consistent use and updating of the studio's playbook and integrated dashboard reporting</li><li>Accelerated stabilization timelines and enhanced management maturity in portcos</li><li>Strengthened link between operational performance and enterprise value creation</li></ul><h2>What We Offer</h2><ul><li>Base salary range of $85,000 - $105,000 plus annual bonus tied to portco financial and other success metrics</li><li>Medical Coverage (80% paid by RVS)</li><li>Dental and Vision Coverage (90% paid by RVS)</li><li>Retirement Plan Contribution and Vesting (Matching up to 4%, + 4% of gross annualized salary)</li><li>2 PTO days per month</li><li>12 scheduled vacation days per year</li><li>Business travel reimbursement + Based photo reimbursement</li></ul><h2>Equal Opportunity</h2><p>The Refounder Venture Studio is committed to building a diverse and inclusive team. We provide equal employment opportunities to all employees and applicants regardless of race, color, religion, sex, sexual orientation, gender identity, national origin, age, disability, or veteran status.</p>"
}
